## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| add    | `aws_lb.cra_upd_ecs_alb`                                    |
|        | `aws_lb_listener.cra_upd_ecs_alb_listener`                  |
|        | `aws_lb_target_group.cra_upd_ecs_lb_target_group`           |
|        | `aws_security_group.cra_upd_loadbalancer_egress_sg`         |
|        | `aws_security_group.cra_upd_loadbalancer_sg`                |
|        | `aws_security_group_rule.cra_upd_sg_rule_egress_lb_to_sg`   |
|        | `aws_security_group_rule.cra_upd_sg_rule_ingress_sg_to_lb`  |
|        | `aws_security_group_rule.cra_upd_sg_rule_ingress_vpc_to_lb` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.cra_upd_ecs_alb will be created
  + resource "aws_lb" "cra_upd_ecs_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 300
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-03abf6f758a19e9a0",
          + "subnet-0b0b8a64cf98261c7",
        ]
      + tags_all                                                     = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.cra_upd_ecs_alb_listener will be created
  + resource "aws_lb_listener" "cra_upd_ecs_alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.cra_upd_ecs_lb_target_group will be created
  + resource "aws_lb_target_group" "cra_upd_ecs_lb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "false"
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 9000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0fffaf0067d0706de"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = (known after apply)
          + path                = "/api/_healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_security_group.cra_upd_loadbalancer_egress_sg will be created
  + resource "aws_security_group" "cra_upd_loadbalancer_egress_sg" {
      + arn                    = (known after apply)
      + description            = "Allow egress to the application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-loadbalancer-egress-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0fffaf0067d0706de"
    }

  # aws_security_group.cra_upd_loadbalancer_sg will be created
  + resource "aws_security_group" "cra_upd_loadbalancer_sg" {
      + arn                    = (known after apply)
      + description            = "LoadBalancer Security Group for CRA UPD"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-loadbalancer-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0fffaf0067d0706de"
    }

  # aws_security_group_rule.cra_upd_sg_rule_egress_lb_to_sg will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_egress_lb_to_sg" {
      + description              = "Allow egress from load balancer to security group on port 9000"
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9000
      + type                     = "egress"
    }

  # aws_security_group_rule.cra_upd_sg_rule_ingress_sg_to_lb will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_ingress_sg_to_lb" {
      + description              = "Allow ingress from security group to load balancer on port 9000"
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9000
      + type                     = "ingress"
    }

  # aws_security_group_rule.cra_upd_sg_rule_ingress_vpc_to_lb will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_ingress_vpc_to_lb" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow ingress from VPC on port 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_loadbalancer_arn              = (known after apply)
  + ecs_loadbalancer_egress_sg_id     = (known after apply)
  + ecs_loadbalancer_listener_arn     = (known after apply)
  + ecs_loadbalancer_sg_id            = (known after apply)
  + ecs_loadbalancer_target_group_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_lb.cra_upd_ecs_alb"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.cra_upd_ecs_alb_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.cra_upd_ecs_lb_target_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_loadbalancer_egress_sg"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_loadbalancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
